Pandas

In [1]:
import numpy as np

In [4]:
import pandas as pd

Series

In [5]:
labels= ['a','b','c']
my_data = [10,20,30]
arr= np.array(my_data)
d= {'a': 10, 'b': 20, 'c':30}

In [10]:
pd.Series( data=my_data)

0    10
1    20
2    30
dtype: int64

In [11]:
pd.Series(data=my_data, index= labels) #in pands you can choose the name of your index

a    10
b    20
c    30
dtype: int64

In [15]:
lst = ['Dua', 'Ahmed', 'Alyami']
g = ['first name', 'Middel name', 'last name' ]
d_lst= {'first name':'Dua', 'Middel name': 'Ahmed', 'last name': 'Alyami'}

In [23]:
username = pd.Series(data=lst, index= g)

In [25]:
username

first name        Dua
Middel name     Ahmed
last name      Alyami
dtype: object

In [24]:
username = pd.Series(lst,g)

In [26]:
username

first name        Dua
Middel name     Ahmed
last name      Alyami
dtype: object

In [27]:
username['first name'] #calling index in pands similer to list

'Dua'

In [18]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [19]:
#when we call a dictionary using Series it will immedatly set the key as an index
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [20]:
pd.Series(d_lst)

first name        Dua
Middel name     Ahmed
last name      Alyami
dtype: object

In [21]:
ww2= pd.Series([1,2,3,4],['USA','Germany','Uk','Japan'])
#you can pass in the data and the index inside the brakets of series.

In [22]:
ww2

USA        1
Germany    2
Uk         3
Japan      4
dtype: int64

In [28]:
ww2['USA']

1

In [31]:
ser1 = pd.Series([1,2,5,4], ['USA','Germany','Itely','Canada'])

In [32]:
ser1

USA        1
Germany    2
Itely      5
Canada     4
dtype: int64

In [33]:
ser1 + ww2 #in pandas and numpy they will change number into float in adding to save data
           # since float is more wider than intgers

Canada     NaN
Germany    4.0
Itely      NaN
Japan      NaN
USA        2.0
Uk         NaN
dtype: float64

In [34]:
info = pd.Series(['Dua', 27, 'Data scientist'], ['Name', 'age', 'career'])

In [35]:
info

Name                 Dua
age                   27
career    Data scientist
dtype: object

In [36]:
info['age']

27

DATA FRAMES part 1

In [38]:
from numpy.random import randn

In [39]:
np.random.seed(101)

In [40]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['W','X','Y','Z'])

In [41]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [42]:
df['W'] #an output like series because it's series when you check data type

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [43]:
type(df['W'])

pandas.core.series.Series

In [45]:
type(df) #df as a whole is a dataframe but each column inside is series

pandas.core.frame.DataFrame

In [46]:
df[['W','Z']] #calling only 2 cloumns

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [71]:
df['new'] = df['W'] + df['X'] #to add a column to table

In [72]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [73]:
df.drop(['new'], axis = 1) #how to delete a clolumn

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [74]:
df #it will still be printed after delete because we didn't say inplace = true

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [75]:
df.drop(['new'], axis = 1, inplace= True)

In [76]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [77]:
df.loc['D'] #this is how to call a row out of the table data frame #loc stands for location

W    0.188695
X   -0.758872
Y   -0.933237
Z    0.955057
Name: D, dtype: float64

In [78]:
df.iloc[3] #calling using the index number instead of the row name

W    0.188695
X   -0.758872
Y   -0.933237
Z    0.955057
Name: D, dtype: float64

In [79]:
df.loc['B', 'Y'] #calling like numpy first row then cloumn with comma between

-0.8480769834036315

In [82]:
df.loc[['C','E'],['W','X']] #calling 2 rows with 2 colums

          W         X
C -2.018168  0.740122
E  0.190794  1.978757

In [83]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [86]:
boole = df<0

In [87]:
boole

       W      X      Y      Z
A  False  False  False  False
B  False   True   True  False
C   True  False  False   True
D  False   True   True  False
E  False  False  False  False

In [88]:
df[boole] #passing boole value inside df

          W         X         Y         Z
A       NaN       NaN       NaN       NaN
B       NaN -0.319318 -0.848077       NaN
C -2.018168       NaN       NaN -0.589001
D       NaN -0.758872 -0.933237       NaN
E       NaN       NaN       NaN       NaN

In [89]:
df[df>0] #shortcut instead of using veriable like boole in previous steps

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [92]:
df[(df['W']<1) & (df['Y']>1)] #muitlple conditions but we should use & not And because And 
                              #will make an error

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [93]:
df[(df['W']>0) | (df['Y']>1)] #using | instead of or

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [97]:
#if you want to reset the index to numrical values since they are now letter
#user reset method
#changes will never get saved unless you pass inplace=True inside the brakets 
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [98]:
df #df is the same because we didn't pass inplace=true inside the brakets of the method

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [100]:
newid= 'CA NY NV PA JE'.split()

In [101]:
newid

['CA', 'NY', 'NV', 'PA', 'JE']

In [102]:
df['States']= newid

In [103]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     NV
D  0.188695 -0.758872 -0.933237  0.955057     PA
E  0.190794  1.978757  2.605967  0.683509     JE

In [106]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
NV     -2.018168  0.740122  0.528813 -0.589001
PA      0.188695 -0.758872 -0.933237  0.955057
JE      0.190794  1.978757  2.605967  0.683509

In [107]:
df #changes will never get saved unless you pass inplace=True inside the brakets

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     NV
D  0.188695 -0.758872 -0.933237  0.955057     PA
E  0.190794  1.978757  2.605967  0.683509     JE

Data frames part 3

In [108]:
import numpy as np
import pandas as pd

In [120]:
#index
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]
hire_index = list(zip(outside,inside)) #to combine 2 list into list of tuples
hire_index = pd.MultiIndex.from_tuples(hire_index)

In [121]:
hire_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [122]:
gf = pd.DataFrame(randn(6,2),hire_index,['A', 'B'])

In [123]:
gf

             A         B
G1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
G2 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366

In [127]:
gf.loc['G1']

          A         B
1 -0.497104 -0.754070
2 -0.943406  0.484752
3 -0.116773  1.901755

In [128]:
gf.loc['G1'].loc[1]

A   -0.497104
B   -0.754070
Name: 1, dtype: float64

In [125]:
gf.loc['G2']

          A         B
1  0.238127  1.996652
2 -0.993263  0.196800
3 -1.136645  0.000366

In [129]:
gf.loc['G2'].loc[1, 'A']

0.23812695876901832

In [131]:
gf.index.names

FrozenList([None, None])

In [132]:
gf.index.names = ['Groups', 'Num']

In [133]:
gf

                   A         B
Groups Num
G1     1   -0.497104 -0.754070
       2   -0.943406  0.484752
       3   -0.116773  1.901755
G2     1    0.238127  1.996652
       2   -0.993263  0.196800
       3   -1.136645  0.000366

In [136]:
gf.loc['G1'].loc[1, 'B']

-0.7540697010400628

In [138]:
gf.loc['G2'].loc[2]['B']

0.19679950499134005

In [140]:
gf.xs('G1')

            A         B
Num
1   -0.497104 -0.754070
2   -0.943406  0.484752
3   -0.116773  1.901755

In [142]:
gf.xs(1, level ='Num')

               A         B
Groups
G1     -0.497104 -0.754070
G2      0.238127  1.996652

In [144]:
gf.xs(3, level = 'Num')

               A         B
Groups
G1     -0.116773  1.901755
G2     -1.136645  0.000366

Missing Data

In [145]:
import numpy as np
import pandas as pd

In [146]:
o = {'A':[1,2,np.nan], 'B':[5, np.nan, np.nan],'C':[6,7,8]}

In [148]:
vg = pd.DataFrame(o)

In [149]:
vg

     A    B  C
0  1.0  5.0  6
1  2.0  NaN  7
2  NaN  NaN  8

In [150]:
vg.dropna() #without passing a value it will drop any row with Nan value

     A    B  C
0  1.0  5.0  6

In [152]:
vg.dropna(axis=1) #drop any cloum that have nan value

   C
0  6
1  7
2  8

In [153]:
vg.dropna(thresh=2) # because the row has 2 value that are not null value so it will be kept

     A    B  C
0  1.0  5.0  6
1  2.0  NaN  7

In [154]:
vg.dropna(thresh=1) # keep the row that have at leat one value that is not none

     A    B  C
0  1.0  5.0  6
1  2.0  NaN  7
2  NaN  NaN  8

In [156]:
vg.fillna(value= 'Fill Value') #  we filled nane value with text fill value

            A           B  C
0         1.0         5.0  6
1         2.0  Fill Value  7
2  Fill Value  Fill Value  8

In [159]:
vg['A'].fillna(value = vg['A'].mean()) # fill na with the middel

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

Groupby

In [160]:
import numpy as np
import pandas as pd

In [161]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'], 
        'Person':['Sam', 'Charlie','Amy','Vanessa','Carl','Sarah'], 
        'Sales':[200,120,340,124,243,350]}

In [162]:
tc = pd.DataFrame(data)

In [163]:
tc

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [168]:
comp = tc.groupby('Company')

In [170]:
comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [171]:
comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [173]:
comp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [174]:
comp.sum().loc['FB']#getting only the sales of facebook

Sales    593
Name: FB, dtype: int64

In [176]:
comp = tc.groupby('Company').sum().loc['FB'] #all in one line

In [177]:
comp

Sales    593
Name: FB, dtype: int64

In [179]:
tc.groupby('Company').sum().loc['GOOG']

Sales    320
Name: GOOG, dtype: int64

In [180]:
tc.groupby('Person').count().loc['Sam'] #count works with string

Company    1
Sales      1
Name: Sam, dtype: int64

In [181]:
tc.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [182]:
tc.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [184]:
tc.groupby('Company').describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

Merging, Joining and Concatenating

In [185]:
import pandas as pd

In [186]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [187]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [188]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [189]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [190]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [191]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

1 - Concatenating: glue the data frames togather

In [193]:
pd.concat([df1,df2,df3]) #to join along the rows

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [195]:
pd.concat([df1,df2,df3], axis =1) #to join along the colums

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

2- Merging

In [ ]:
#when you merge 2 data frames using thier mutual cloumn like key cloumn in the below example

In [196]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [198]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [199]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [202]:
pd.merge(left,right, how='inner', on = 'key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [205]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [207]:
pd.merge(left,right, on= ['key1', 'key2']) #by defult it will merge on inner

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [208]:
pd.merge(left,right, how = 'inner', on = ['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [209]:
pd.merge(left,right, how = 'outer', on = ['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [210]:
pd.merge(left,right, how = 'left', on = ['key1','key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [211]:
pd.merge(left,right, how = 'right', on = ['key1','key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

3- Join

In [203]:
#when you want to join 2 data frames having the diffrent index 
#join of index instead of cloumn

In [213]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [214]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [216]:
right.join(left, how='outer')

      C    D    A    B
K0   C0   D0   A0   B0
K1  NaN  NaN   A1   B1
K2   C2   D2   A2   B2
K3   C3   D3  NaN  NaN

Operation

In [219]:
import pandas as pd
zf = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
zf.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [220]:
zf['col2'].unique()

array([444, 555, 666])

In [221]:
len(zf['col2'].unique()) #to check the lenghth of the array

3

In [222]:
zf['col2'].nunique() #to check the lenght of array using n-unique

3

In [223]:
# Unique to print array - Nunique to print the lenghth of an array

In [225]:
zf['col2'].value_counts() #to count how much the value occured in the array 444 twice

444    2
666    1
555    1
Name: col2, dtype: int64

In [228]:
zf[zf['col1']> 2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [229]:
zf['col1']> 2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [232]:
zf[(zf['col1']> 2) & (zf['col2']==444)] #condtional selection

   col1  col2 col3
3     4   444  xyz

In [233]:
zf['col2'].sum()

2109

In [234]:
def times2(x):
    return 2*x

In [237]:
zf['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [238]:
zf['col3'].apply(len) #to know the length of each string in col3

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [239]:
zf['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [240]:
zf['col1'].apply(lambda x: x+1)

0    2
1    3
2    4
3    5
Name: col1, dtype: int64

In [241]:
zf.drop('col1', axis = 1) #we have to write axis =1 because it's a cloumn

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [243]:
zf.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [244]:
zf.index

RangeIndex(start=0, stop=4, step=1)

In [245]:
zf.sort_values('col2') #make them in order

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [246]:
zf.isnull() #searching for null values

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [247]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [248]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [250]:
df.pivot_table(values=['D'], index=['A','B'], columns= ['C'])

           D
C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

Data Inputs and Outputs

In [257]:
pwd

'/Users/DUA/Downloads/Refactored_Py_DS_ML_Bootcamp-master/01-Python-Crash-Course'